<center>
    
# äººå·¥æ™ºèƒ½é«˜é˜¶äººæ‰åŸ¹è®­ç­
## è¯¾ç¨‹ä½œä¸šï¼ˆäºŒï¼‰

---

> ğŸ’¥è¯´æ˜ğŸ’¥
> 1. æœ¬æ¬¡ä½œä¸šæœ€æ™šæäº¤æ—¶é—´ï¼š **<font color='red'>2019å¹´6æœˆ12æ—¥</font>**
> 2. ä½œä¸šä¸­ä»¥`Q-n`æ ‡æ³¨çš„å‡ ä¸ªé—®é¢˜çš„ç­”æ¡ˆè¯·é€šè¿‡[ç­”é¢˜é¡µé¢](https://app.askform.cn/43245470-5adc-4293-9427-0a33e9743625.aspx?Type=2)è¿æ¥çš„Formè¡¨æ ¼æäº¤ï¼Œæäº¤ä¸­å¡«å†™çš„å§“åè¯·ä¸æœ¬äººå§“åä¿æŒä¸€è‡´ï¼›
> 3. ä»¥`Lesson02-HW-{ä½ çš„åå­—è‹±æ–‡}.ipynb`å‘½åçš„ä½œä¸šæ–‡ä»¶è¯·å‚è€ƒ[æ–‡æ¡£](../How-To.md)è¯´æ˜æäº¤åˆ°Gitçš„ä»£ç ä»“åº“ï¼›
> 4. å¦‚æœå®Œæˆä½œä¸šè¿‡ç¨‹ä¸­ï¼Œä½ æœ‰ä»»ä½•æ–°çš„æƒ³æ³•å’Œè§£é¢˜æ€è·¯ï¼Œå¯ä»¥å®Œæˆä¸€ç¯‡åˆ†äº«æ–‡æ¡£(å»ºè®®ç”¨MarkDownæ’°å†™)ï¼Œå°†æ ¹æ®è´¨é‡ç»™äºˆâ­å¥–åŠ±
> 5. ğŸš« **æ³¨æ„ï¼š** è¯·ä¸è¦ç›´æ¥ç¼–è¾‘è¯¥æ¨¡æ¿æ–‡ä»¶ï¼Œå»ºè®®å¤åˆ¶è¯¥æ¨¡æ¿æ–‡ä»¶ç”Ÿæˆæ–°çš„ä»¥ä½ è‡ªå·±å§“åå‘½åçš„ä½œä¸šæ–‡ä»¶ï¼ˆ`Lesson02-HW-{ä½ çš„åå­—ä¸­æ–‡}.ipynb`ï¼‰
> 6.....

### Q1
å‚è€ƒè¯¾ç¨‹ä¸­ä½¿ç”¨`numpy`è¿›è¡Œæ•°ç†ç»Ÿè®¡çš„è¿‡ç¨‹ï¼Œä½¿ç”¨numpyæä¾›çš„åº“`random.normal`ç”Ÿæˆ1ä¸‡ä¸ªæ ·æœ¬

æœ¬é¢˜ç›®ä¸­ä½¿ç”¨ä¸‹è¡¨æ ¼ä¸­**åä¸­åœ°åŒºçš„å¥³æ€§èº«é«˜æ•°æ®**ä½œä¸ºå‚è€ƒæº

<center>

##### ä¸­å›½æˆå¹´äººèº«é«˜ï¼Œä½“é‡å‡å€¼å’Œæ ‡å‡†å·®çš„å‚è€ƒå€¼ ï¼ˆ2015ï¼‰
|æ€§åˆ«|ä¸œåŒ—ååŒ—|è¥¿åŒ—|ä¸œå—|åä¸­|åå—|è¥¿å—|
|-|-|-|-|-|-|-|
|èº«é«˜ï¼Œä½“é‡|å‡å€¼ï¼Œæ ‡å‡†å·®|å‡å€¼ï¼Œæ ‡å‡†å·®|å‡å€¼ï¼Œæ ‡å‡†å·®|å‡å€¼ï¼Œæ ‡å‡†å·®|å‡å€¼ï¼Œæ ‡å‡†å·®|å‡å€¼ï¼Œæ ‡å‡†å·®|
|ç”·(mm)|1693, 56.6|1684, 53.7|1686, 55,2|1669, 56.3|1650, 57.1|1647, 56.7|
|å¥³(mm)|1586, 51.8|1575, 51.9|1575, 50.8|1560, 50.7|1549, 49.7|1546, 53.9|
|ç”·(kg)|64, 8.2|60, 7.6|59, 7.7|57, 6.9|56, 6.9|55, 6.8|
|å¥³(kg)|55, 7.1|52, 7.1|51, 7.2|50, 6.8|49, 6.5|50, 6.9|


> **æ³¨æ„ï¼š**ä¸ºä¿è¯ç»“æœçš„ä¸€è‡´æ€§ï¼Œè¯·æ¯æ¬¡åœ¨ä½ æ‰§è¡Œéšæœºåˆ†å¸ƒç”Ÿæˆä¹‹å‰ï¼Œä½¿ç”¨`np.random.seed(42)`ï¼Œäº§ç”ŸåŒæ ·çš„ç§å­å€¼

#### é—®ï¼š ä½ ç”Ÿæˆçš„åˆ†å¸ƒçš„å®é™…äº§ç”Ÿçš„æ–¹å·®ã€å‡å€¼ã€ä¸­ä½æ•°å„æ˜¯å¤šå°‘(ä¿ç•™ä¸¤ä½å°æ•°)ï¼Ÿ
- 50.70, 1560.01, 1575.91
- 50.87, 1560, 1560.69
- 2588.06, 1599.89, 1599.87
- 50.87, 1599.89, 1599.87

In [1]:
import numpy as np
np.random.seed(42)
height_10k = np.random.normal(1.560, 0.0507, 10000)   # 10000èº«é«˜æ•°æ®   
#hzFemale_height = height_10k[:,0]  #10000åä¸­å¥³æ€§æ•°æ®èº«é«˜å€¼
hzFemale_height_var = np.var(height_10k)    # èº«é«˜æ–¹å·®
hzFemale_height_mean = np.mean(height_10k)  # èº«é«˜å‡å€¼
hzFemale_height_median = np.median(height_10k)    # èº«é«˜ä¸­ä½æ•°
print('åä¸­å¥³æ€§èº«é«˜æ–¹å·®'+str(hzFemale_height_var*(1000**2)))
print('åä¸­å¥³æ€§èº«é«˜å‡å€¼'+str(hzFemale_height_mean*1000))
print('åä¸­å¥³æ€§èº«é«˜ä¸­ä½æ•°'+str(hzFemale_height_median*1000))
#ç­”æ¡ˆæ˜¯C

åä¸­å¥³æ€§èº«é«˜æ–¹å·®2588.0620120725184
åä¸­å¥³æ€§èº«é«˜å‡å€¼1559.8917056432208
åä¸­å¥³æ€§èº«é«˜ä¸­ä½æ•°1559.868434727301

## Q2-Q9
Q2-Q9å°†ä½¿ç”¨kaggleå…¥é—¨ä¸­å¸¸ä½¿ç”¨çš„æ³°å¦å°¼å…‹æ•°æ®é›†ï¼Œè¯¦æƒ…å¯ä»¥è®¿é—®[Titanic: Machine Learning from Disaster](https://www.kaggle.com/c/titanic)ï¼Œä¸ºäº†æ–¹ä¾¿å¤„ç†æˆ‘ä»¬å·²ç»å¯¹åŸå§‹æ•°æ®è¿›è¡Œäº†åˆæ­¥çš„å¤„ç†ï¼ˆå¦‚ç¼ºå¤±å€¼ã€å¼‚å¸¸å€¼ç­‰ï¼‰ã€‚

åœ¨è¿™ä¸€ç³»åˆ—é¢˜ç›®ä¸­ï¼Œæˆ‘ä»¬å°†ç»¼åˆä½¿ç”¨`numpy`, `pandas`å’Œ`matplotlib`è§£å†³ä¸€ä¸ªæ³°å¦å°¼å…‹å·æ•°æ®çš„åˆæ­¥åˆ†æé—®é¢˜ã€‚åœ¨æœºå™¨å­¦ä¹ ä¸­ï¼Œé€šè¿‡å¤šç§ä¸åŒçš„æ–¹å¼å¯¹æ•°æ®è¿›è¡Œåˆ†ææœ‰åŠ©äºåŠæ—¶æ•è·æ•°æ®ç‰¹å¾å’Œæ•°æ®ä¹‹é—´çš„å…³è”ã€‚

In [2]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt

é¦–å…ˆæˆ‘ä»¬ä½¿ç”¨pandaså¯¼å…¥æ•°æ®

In [3]:
data = pd.read_csv('../data/titanic_train.csv',
                  index_col='PassengerId')

æŸ¥çœ‹æ•°æ®ç»“æ„å’ŒåŸºæœ¬ç»„æˆ

In [4]:
data.head(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

æ¯ä¸ªå­—æ®µçš„å«ä¹‰å¦‚ä¸‹ï¼š

| **Variable** | **Definition**                             | **Key**                                        |
| ------------ | ------------------------------------------ | ---------------------------------------------- |
| survival     | Survival                                   | 0 = No, 1 = Yes                                |
| pclass       | Ticket class                               | 1 = 1st, 2 = 2nd, 3 = 3rd                      |
| sex          | Sex                                        |                                                |
| Age          | Age in years                               |                                                |
| sibsp        | # of siblings / spouses aboard the Titanic |                                                |
| parch        | # of parents / children aboard the Titanic |                                                |
| ticket       | Ticket number                              |                                                |
| fare         | Passenger fare                             |                                                |
| cabin        | Cabin number                               |                                                |
| embarked     | Port of Embarkation                        | C = Cherbourg, Q = Queenstown, S = Southampton |

In [5]:
data.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

ä¸ºäº†è®©å¤§å®¶å¿«é€Ÿç†Ÿæ‚‰pandasï¼Œæˆ‘ä»¬å‡†å¤‡äº†å‡ ä¸ªç®€å•çš„æ“ä½œï¼š

1. è®©æˆ‘ä»¬å°è¯•ä»ä¹˜å®¢ä¸­è¿‡æ»¤åªæ˜¾ç¤ºé€šè¿‡Cherbourg(Embarked=C) ç™»é™†å¹¶ä¸”ä»˜è´¹å¤§äº200ç£…ï¼ˆfare > 200ï¼‰ï¼š

In [6]:
data[(data['Embarked'] == 'C') & (data.Fare > 200)].head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
119,0,1,"Baxter, Mr. Quigg Edmond",male,24.0,0,1,PC 17558,247.5208,B58 B60,C
259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
300,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,0,1,PC 17558,247.5208,B58 B60,C
312,1,1,"Ryerson, Miss. Emily Borie",female,18.0,2,2,PC 17608,262.3750,B57 B59 B63 B66,C
378,0,1,"Widener, Mr. Harry Elkins",male,27.0,0,2,113503,211.5000,C82,C

2. æˆ‘ä»¬å¯ä»¥ä½¿ç”¨`sort_values`é™åºæ’åˆ—è¿™äº›æ•°æ®ï¼Œæ’åºå…³é”®å­—é€šè¿‡`by`å­—æ®µå®šä¹‰

In [7]:
data[(data['Embarked'] == 'C') & 
     (data['Fare'] > 200)].sort_values(by='Fare',
                               ascending=False).head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
312,1,1,"Ryerson, Miss. Emily Borie",female,18.0,2,2,PC 17608,262.3750,B57 B59 B63 B66,C
743,1,1,"Ryerson, Miss. Susan Parker ""Suzette""",female,21.0,2,2,PC 17608,262.3750,B57 B59 B63 B66,C

3. æˆ‘ä»¬æ¥å°è¯•åœ¨æ•°æ®ä¸­æ·»åŠ ä¸€ä¸ªæ–°çš„ç‰¹å¾ï¼ˆä¸€ä¸ªæ–°çš„columnï¼‰

In [9]:
def age_category(age):
    '''
    < 30 -> 1
    >= 30, <55 -> 2
    >= 55 -> 3
    '''
    if age < 30:
        return 1
    elif age < 55:
        return 2
    elif age >= 55:
        return 3

In [10]:
age_categories = [age_category(age) for age in data.Age]
data['Age_category'] = age_categories

å¦ä¸€ç§å®ç°æ–¹æ³•æ˜¯é€šè¿‡`.apply`å‡½æ•°å®ç°
```python
data['Age_category'] = data['Age'].apply(age_category)
```

ä½ å¯ä»¥é€šè¿‡`data.head()`å‘½ä»¤æŸ¥çœ‹æ–°çš„æ•°æ®çš„æƒ…å†µ

In [11]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_category
PassengerId,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1.0
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2.0
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1.0
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2.0
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,2.0

### **Q2. èˆ¹ä¸Šæœ‰å¤šå°‘ç”·æ€§å’Œå¥³æ€§ï¼Ÿ**
- 412 ç”·æ€§ 479 å¥³æ€§
- 314 ç”·æ€§ 577 å¥³æ€§
- 479 ç”·æ€§ 412 å¥³æ€§
- 577 ç”·æ€§ 314 å¥³æ€§

In [12]:
# åœ¨æ­¤ç¼–å†™ä»£ç å›ç­”é—®é¢˜
numMale=data['Sex'][(data['Sex']== 'male')].count()
numFemale=data['Sex'][(data['Sex']== 'female')].count()
print(str(numMale)+'ç”·æ€§ '+str(numFemale)+'å¥³æ€§')
#ç­”æ¡ˆæ˜¯D

577ç”·æ€§ 314å¥³æ€§

### **Q3. å½“æ—¶èˆ¹ä¸Šæœ‰å¤šå°‘ç”·æ€§æŒæœ‰äºŒçº§èˆ¹ç¥¨ï¼ˆPclass=2ï¼‰ï¼Ÿ**
- 104
- 108
- 112
- 125

In [13]:
# åœ¨æ­¤ç¼–å†™ä»£ç å›ç­”é—®é¢˜
data['Sex'][(data['Sex']== 'male')&(data.Pclass==2)].count()
#ç­”æ¡ˆæ˜¯B

108

### **Q4. æ‰€æœ‰ä¹˜å®¢Fareçš„ä¸­ä½æ•°å’Œæ ‡å‡†å·®æ˜¯å¤šå°‘ï¼Ÿï¼ˆä¿ç•™ä¸¤ä½å°æ•°ï¼‰**
- ä¸­ä½æ•°ä¸º 14.45, æ ‡å‡†å·®ä¸º 49.69
- ä¸­ä½æ•°ä¸º 15.1, æ ‡å‡†å·®ä¸º 12.15
- ä¸­ä½æ•°ä¸º 13.15, æ ‡å‡†å·®ä¸º 35.3
- ä¸­ä½æ•°ä¸º  17.43, æ ‡å‡†å·®ä¸º 39.1

In [14]:
# åœ¨æ­¤ç¼–å†™ä»£ç å›ç­”é—®é¢˜

fare_median = data['Fare'].median()   # ä¸­ä½æ•°
fare_std = data['Fare'].std()  # æ ‡å‡†å·®
print('ä¸­ä½æ•°ä¸º'+str(fare_median)+'ï¼Œæ ‡å‡†å·®ä¸º'+str(fare_std))
#ç­”æ¡ˆæ˜¯A

ä¸­ä½æ•°ä¸º14.4542ï¼Œæ ‡å‡†å·®ä¸º49.6934285971809

### **Q5. å¹¸å­˜è€…çš„å¹³å‡å¹´é¾„æ˜¯å¦é«˜äºæœ€ç»ˆæ­»äº¡çš„ä¹˜å®¢?**
- Yes
- No

> Tips: å¯ä»¥å‚è€ƒpandasçš„`groupby`å‘½ä»¤

In [15]:
# åœ¨æ­¤ç¼–å†™ä»£ç å›ç­”é—®é¢˜
gb=data[['Survived','Age']].groupby(['Survived'])
mean_age_survived=gb.get_group(1)['Age'].mean()
mean_age_dead=gb.get_group(0)['Age'].mean()
print('å¹¸å­˜è€…çš„å¹³å‡å¹´é¾„ä¸º'+str(mean_age_survived)+'ï¼Œæœ€ç»ˆæ­»äº¡çš„ä¹˜å®¢å¹³å‡å¹´é¾„ä¸º'+str(mean_age_dead))
print(mean_age_survived>mean_age_dead)
#ç­”æ¡ˆæ˜¯B

å¹¸å­˜è€…çš„å¹³å‡å¹´é¾„ä¸º28.343689655172415ï¼Œæœ€ç»ˆæ­»äº¡çš„ä¹˜å®¢å¹³å‡å¹´é¾„ä¸º30.62617924528302
False

### **Q6.å¹´é¾„å°äº30å²çš„ä¹˜å®¢æ˜¯å¦æ¯”å¹´é¾„å¤§äº60å²çš„ä¹˜å®¢æœ‰æ›´å¤§çš„å­˜æ´»æ¦‚ç‡ï¼Ÿ å­˜æ´»æ¦‚ç‡å„ä¸ºå¤šå°‘ï¼Ÿ**
- å¹´è½»äººä¸º22.7%ï¼Œå¹´é•¿è€…ä¸º40.6% 
- å¹´è½»äººä¸º40.6%ï¼Œ å¹´é•¿è€…ä¸º22.7%
- å¹´è½»äººä¸º35.3%ï¼Œå¹´é•¿è€…ä¸º27.4%
- å¹´è½»äººä¸º27.4%ï¼Œå¹´é•¿è€…ä¸º35.3%

> Tips: å¯ä»¥æŸ¥çœ‹ pandas.crosstab()å‡½æ•°çš„ç”¨æ³•

In [16]:
# åœ¨æ­¤ç¼–å†™ä»£ç å›ç­”é—®é¢˜
#891è¡Œä¸­714è¡Œæœ‰Ageæ•°æ®
#data_age_less_30=data.loc[:,['Survived']][data['Age']<30]
data_age_less_30=data['Survived'][data['Age']<30]
num_age_less_30=data_age_less_30.count()
num_survived_age_less_30=data['Survived'][(data['Age']<30)&(data['Survived']==1)].count()
print('å¹´é¾„å°äº30å²çš„ä¹˜å®¢äººæ•°ä¸º'+str(num_age_less_30)+',å…¶ä¸­å­˜æ´»äººæ•°ä¸º'+str(num_survived_age_less_30)+',å­˜æ´»ç‡ä¸º'+str(num_survived_age_less_30/num_age_less_30))

data_age_over_60=data['Survived'][data['Age']>60]
num_age_over_60=data_age_over_60.count()
num_survived_age_over_60=data['Survived'][(data['Age']>60)&(data['Survived']==1)].count()
print('å¹´é¾„å¤§äº60å²çš„ä¹˜å®¢äººæ•°ä¸º'+str(num_age_over_60)+',å…¶ä¸­å­˜æ´»äººæ•°ä¸º'+str(num_survived_age_over_60)+',å­˜æ´»ç‡ä¸º'+str(num_survived_age_over_60/num_age_over_60))

#æ–¹æ³•äºŒ
def age_cat2(age):
    if age < 30:
        return 1
    elif age <=60:
        return 2
    elif age > 60:
        return 3

data['AgeCat2'] = data['Age'].apply(age_cat2)   

pd.crosstab(data['AgeCat2'],data['Survived'],margins=True)


#ç­”æ¡ˆæ˜¯B

å¹´é¾„å°äº30å²çš„ä¹˜å®¢äººæ•°ä¸º384,å…¶ä¸­å­˜æ´»äººæ•°ä¸º156,å­˜æ´»ç‡ä¸º0.40625
å¹´é¾„å¤§äº60å²çš„ä¹˜å®¢äººæ•°ä¸º22,å…¶ä¸­å­˜æ´»äººæ•°ä¸º5,å­˜æ´»ç‡ä¸º0.22727272727272727

Survived    0    1  All
AgeCat2
1.0       228  156  384
2.0       179  129  308
3.0        17    5   22
All       424  290  714

### **Q7. å¥³æ€§æ˜¯å¦æ¯”ç”·æ€§æœ‰æ›´å¤§çš„å­˜æ´»æ¦‚ç‡? ç”·æ€§ä¸å¥³æ€§å­˜æ´»äººæ•°å„å æ‰€åœ¨æ€§åˆ«çš„ç™¾åˆ†ä¹‹å¤šå°‘ï¼Ÿ**
- ç”·æ€§ä¸º30.2%, å¥³æ€§ä¸º46.2%
- ç”·æ€§ä¸º35.7%, å¥³æ€§ä¸º74.2%
- ç”·æ€§ä¸º21.1%, å¥³æ€§ä¸º46.2%
- ç”·æ€§ä¸º18.9%, å¥³æ€§ä¸º74.2%

In [17]:
# åœ¨æ­¤ç¼–å†™ä»£ç å›ç­”é—®é¢˜
#æ–¹æ³•ä¸€
data_male=data['Survived'][data['Sex']=='male']
num_male=data_male.count()
num_survived_male=data['Survived'][(data['Sex']=='male')&(data['Survived']==1)].count()
print('ç”·æ€§ä¹˜å®¢äººæ•°ä¸º'+str(num_male)+',å…¶ä¸­å­˜æ´»äººæ•°ä¸º'+str(num_survived_male)+',å­˜æ´»ç‡ä¸º'+str(num_survived_male/num_male))

data_female=data['Survived'][data['Sex']=='female']
num_female=data_female.count()
num_survived_female=data['Survived'][(data['Sex']=='female')&(data['Survived']==1)].count()
print('ç”·æ€§ä¹˜å®¢äººæ•°ä¸º'+str(num_female)+',å…¶ä¸­å­˜æ´»äººæ•°ä¸º'+str(num_survived_female)+',å­˜æ´»ç‡ä¸º'+str(num_survived_female/num_female))

#æ–¹æ³•äºŒ
pd.crosstab(data['Survived'],data['Sex'],margins=True)


#ç­”æ¡ˆæ˜¯D

ç”·æ€§ä¹˜å®¢äººæ•°ä¸º577,å…¶ä¸­å­˜æ´»äººæ•°ä¸º109,å­˜æ´»ç‡ä¸º0.18890814558058924
ç”·æ€§ä¹˜å®¢äººæ•°ä¸º314,å…¶ä¸­å­˜æ´»äººæ•°ä¸º233,å­˜æ´»ç‡ä¸º0.7420382165605095

Sex       female  male  All
Survived
0             81   468  549
1            233   109  342
All          314   577  891

### **Q8. ç”·æ€§ä¹˜å®¢ä¸­æœ€å—æ¬¢è¿çš„åå­—æ˜¯ä»€ä¹ˆï¼Ÿ**
- Charles
- Thomas
- William
- John

> Tipsï¼š è¯·å¯¹ç…§ç»™å‡ºçš„å‡ ä¸ªé€‰é¡¹äº†è§£åå­—å‡ºç°çš„ä½ç½®

In [18]:
# åœ¨æ­¤ç¼–å†™ä»£ç å›ç­”é—®é¢˜
def middle_name(fullname):
    temp1=fullname.split('Mr.')[1:]
    if len(fullname.split('Mr.')[1:])==0: 
        return ''
    elif len(fullname.split('Mr.')[1:][0].split(' '))<2:
        return ''
    else:
        return fullname.split('Mr.')[1:][0].split(' ')[1]

data['MiddleName'] = data['Name'].apply(middle_name)   

pd.crosstab(data['MiddleName'],data['Sex'][(data['Sex']=='male')],margins=False).sort_values(by='male', ascending=False)

#ç­”æ¡ˆæ˜¯C

Sex         male
MiddleName
              60
William       30
John          21
George        12
Charles       12
James         11
Thomas        11
Henry         10
Richard        9
Johan          9
Edward         8
Frederick      8
Karl           7
Joseph         6
Alfred         6
Samuel         6
Victor         5
Robert         5
Harry          5
Peter          5
Albert         5
Ivan           4
Ernst          4
David          4
Daniel         4
Hans           4
Patrick        4
Arthur         4
Walter         4
August         4
...          ...
Malkolm        1
Mansouer       1
Jeremiah       1
Janko          1
Fletcher       1
Jan            1
Francesco      1
Francisco      1
Frans          1
Frederic       1
Fridtjof       1
Guentcho       1
Gurshon        1
Gustave        1
Hammad         1
Harvey         1
Henrik         1
Herbert        1
Herman         1
Houssein       1
Howard         1
Husein         1
Ignjac         1
Iisakki        1
Ilia           1
Ilmari         1
Ingvald        1
Jaako          1
Jacques        1
Yousseff       1

[264 rows x 1 columns]

### **Q9. ç”·æ€§/å¥³æ€§çš„å¹³å‡å¹´é¾„ä¸`Pclass`çš„å…³ç³»ï¼Œå¦‚ä¸‹å£°æ˜æ­£ç¡®çš„æ˜¯(å¤šé€‰)ï¼š**
- å¹³å‡è€Œè¨€ï¼Œä¸€çº§ä»“ä¸­çš„ç”·æ€§å¹´é¾„å¹³å‡è¶…è¿‡40å²
- ä¸€çº§ä»“ä¸­å¥³æ€§çš„å¹³å‡å¹´é¾„è¶…è¿‡40å²
- æ‰€æœ‰ä¸åŒçº§åˆ«ä»“ä¸­ç”·æ€§çš„å¹³å‡å¹´é¾„éƒ½å¤§äºåŒä¸€çº§ä»“ä¸­çš„å¥³æ€§
- å¹³å‡è€Œè¨€ï¼Œä¸€çº§ä»“ä¹˜å®¢å¹´é¾„å¤§äºäºŒçº§ç¥¨ä»“ï¼ŒäºŒçº§ä»“å¤§äºä¸‰çº§ç¥¨ä»“

In [19]:
# åœ¨æ­¤ç¼–å†™ä»£ç å›ç­”é—®é¢˜
num1=data['Age'][(data['Sex']== 'male')&(data.Pclass==1)].mean()
print('A.ä¸€çº§ä»“ä¸­çš„ç”·æ€§å¹´é¾„å¹³å‡ä¸º'+str(num1)+'å²')  #Aæ­£ç¡®

num2=data['Age'][(data['Sex']== 'female')&(data.Pclass==1)].mean()
print('B.ä¸€çº§ä»“ä¸­çš„å¥³æ€§å¹´é¾„å¹³å‡ä¸º'+str(num2)+'å²')  #Bé”™è¯¯


#Cæ­£ç¡®
print('C.é€‰é¡¹ï¼š')
print(data[['Pclass','Sex','Age']].groupby(['Pclass','Sex']).mean())

# Dæ­£ç¡®
#gb=data[['Pclass','Age']].groupby(['Pclass'])
#num_p1_mean=gb.get_group(1)['Age'].mean()
#num_p2_mean=gb.get_group(2)['Age'].mean()
#num_p3_mean=gb.get_group(3)['Age'].mean()
#print('D.ä¸€çº§ä»“ä¹˜å®¢å¹´é¾„å¹³å‡ä¸º'+str(num_p1_mean)+'å²')
#print('D.äºŒçº§ä»“ä¹˜å®¢å¹´é¾„å¹³å‡ä¸º'+str(num_p2_mean)+'å²')
#print('D.ä¸‰çº§ä»“ä¹˜å®¢å¹´é¾„å¹³å‡ä¸º'+str(num_p3_mean)+'å²')
print('D.é€‰é¡¹ï¼š')
print(data[['Pclass','Age']].groupby(['Pclass']).mean())

#pd.crosstab(data['Pclass'],data['Sex'],margins=True)
#ç­”æ¡ˆæ˜¯Aã€Cã€D

A.ä¸€çº§ä»“ä¸­çš„ç”·æ€§å¹´é¾„å¹³å‡ä¸º41.28138613861386å²
B.ä¸€çº§ä»“ä¸­çš„å¥³æ€§å¹´é¾„å¹³å‡ä¸º34.61176470588235å²
C.é€‰é¡¹ï¼š
                     Age
Pclass Sex
1      female  34.611765
       male    41.281386
2      female  28.722973
       male    30.740707
3      female  21.750000
       male    26.507589
D.é€‰é¡¹ï¼š
              Age
Pclass
1       38.233441
2       29.877630
3       25.140620